[
    {
        "name":"Bessine Walterbach, LLP",
        "primary_contact":"Primary Contact: Scott Walterbach",
        "address":"3000 NE Brooktree Lane, Suite 100 Kansas City, Missouri 64119",
        "phone":"816.595.8489",
        "fax":"816.601.1101",
        "email":"scott@bw-llp.com",
        "website":"http://www.bw-llp.com/",
        "about":"BW, LLP is a small law firm in Kansas City focusing on collections & creditors' rights. We handle a high-volume caseload using state-of-the-art technology. Quality service, compliant with all applicable laws, is what we do. Being honest & treating all people well is who we are."
    },
    {
        "name":"Burr Foreman LLP",
        "primary_contact":"Primary Contact: William S. Hereford",
        "address":"420 North 20th Street , Suite 3400 Birmingham, Alabama 35203",
        "phone":"205.458.5310",
        "fax":"205.244.5658",
        "email":"whereford@burr.com",
        "website":"https://www.burr.com/",
        "about":"Burr & Formans experienced legal team serves clients with local, national, and international legal needs. With particular industry strengths in the financial institutions, health care and manufacturing sectors, our attorneys draw from a diverse range of backgrounds and experience to serve as trusted business advisors and legal counsel to help clients achieve their goals. Burr & Forman is a Southeast, regional firm with 360 attorneys and 19 offices in Alabama, Delaware, Florida, Georgia, Mississippi, North Carolina, South Carolina and Tennessee."
    },
    {
        "name":"Butler & Hosch, P.A.",
        "primary_contact":"Primary Contact: Austin B. Barnes, III",
        "address":"3860 Ben Hur Ave. Suite 1 Willoughby, Ohio 44094",
        "phone":"866-705-8353",
        "fax":"440-942-6572",
        "email":"abarnes@closingsource.net",
        "website":"http://www.butlerandhosch.com/",
        "about":""
    },
    {
        "name":"Carlisle Law",
        "primary_contact":"Primary Contact: Maureen Zink",
        "address":"24755 Chagrin Blvd. Cleveland, Ohio 44122",
        "phone":"216.360.7200 x205",
        "fax":"216.360.7210",
        "email":"mzink@carlisle-law.com",
        "website":"http://www.Carlisle-Law.com",
        "about":"Ms. Zink has represented tax certificate holders multiple counties in Ohio since 2011. Carlisle Law has represented lending and servicing institutions since 1970 and offers expertise in all aspects of default servicing for its clients."
    },
    {
        "name":"Cleartosell.com",
        "primary_contact":"Primary Contact: Dawn Schneiderman",
        "address":"501 S Flagler Drive Suite 201 West Palm Beach, Florida 33401",
        "phone":"855-680-4908",
        "fax":"",
        "email":"info@cleartosell.com",
        "website":"http://www.cleartosell.com",
        "about":"Imagine if you could re-sell or re-finance your tax-deeded property investments in 20 days rather than waiting for the months of delay of a quiet title action! Many tax deed investors have good reason for holding their properties. But for those who prefer to keep their capital moving, cleartosell.com has the fastest, shortest path available today to be clear to sell your tax-deeded property and release your capital. With fully trained and licensed title researchers available on the ground in every county of Florida, and a sophisticated technology backbone linking everyone in the work flow together, all under the direct supervision of our staff attorneys, we can turn around your instructions in 20 days. Our underwriter-approved process quickly and accurately determines if we can issue a title commitment on your property without the need to file a quiet title action. When it is, our attorneys will certify your property to have clear title and provide written confirmation that a title insurance commitment will be issued by our underwriter partners. There are no limits to the sale price of the property. If we find defects in the title of your property, we will report this to you in writing so you have all the facts at your fingertips. But, here's the good part: You will have the option to credit your fee toward the filing of a quiet title action by our staff attorneys that will be quicker again because of the research we have done. Because the quiet title action is at a low additional cost, in total you will pay no more than if you had gone straight to quiet title action. You can't lose! Trusting the professionals at cleartosell.com is a win-win deal for you. Just click on the create account button on our website and see your capital released faster than you ever imagined possible!"
    },
    {
        "name":"Fleishman Law, PLC",
        "primary_contact":"Primary Contact: Michael Fleishman",
        "address":"6818 North Oracle Road, Suite 426 Tucson, Arizona 85704",
        "phone":"520-308-5270",
        "fax":"520-842-2220",
        "email":"michael@landandbiz.com",
        "website":"http://www.tucsonlanduselaw.com",
        "about":""
    },
    {
        "name":"Fox Rothschild LLP",
        "primary_contact":"Primary Contact: Edward J. Hayes",
        "address":"2000 Market Street, 20th Floor Philadelphia, Pennsylvania 19103-3222",
        "phone":"215.299.2092",
        "fax":"215.299.2150",
        "email":"EHayes@foxrothschild.com",
        "website":"www.foxrothschild.com",
        "about":"Ed's practice involves commercial litigation with a particular emphasis on real estate. Co-Chair of the firm's Title Insurance Defense Group, Ed is recognized as one of the premier title insurance attorneys in Pennsylvania and handles related disputes on behalf of:"
    },
    {
        "name":"Gebhardt Real Estate and Legal Services",
        "primary_contact":"Primary Contact: Phillip K. Gebhardt",
        "address":"1720 North Main P.O. Box 340 Desoto, Missouri 63020",
        "phone":"636-586-4545",
        "fax":"636-586-3504",
        "email":"Phil.Gebhardt@lienfunds.com",
        "website":"",
        "about":"We are well versed in all stages of tax sales purchase. Title work, Noticing, Quiet Title Suites and Real Estate Broker. We will work in St. Louis surrounding counties. Prices vary depending on location and the number of properties involved. Please call if you have questions."
    },
    {
        "name":"Griffin, Hicks & Hicks",
        "primary_contact":"Primary Contact: Brian E. Hicks",
        "address":"7126 N. Shadeland Ave., Suite A Indianapolis, Indiana 46250",
        "phone":"317-585-7000",
        "fax":"317-585-7005",
        "email":"br.hicks@sbcglobal.net",
        "website":"",
        "about":"Experienced tax sale attorney. Handles quiet title cases, tax sale noticing and deed petitioning throughout Indiana."
    },
    {
        "name":"Hobson, Cady & Cady",
        "primary_contact":"Primary Contact: Art Cady",
        "address":"9 1st Street S.W. Hampton, Iowa 50441",
        "phone":"888-575-0326",
        "fax":"641-456-3315",
        "email":"cadyart@rconnect.com",
        "website":"http://www.hobsoncadylaw.com/",
        "about":"Our experienced real estate litigation attorneys have taken cases before the Supreme Court of Iowa, and can assist with closings, document preparation, deeds, title examinations and real estate contracts."
    },
    {
        "name":"Honig & Greenberg, LLC",
        "primary_contact":"Primary Contact: Adam D. Greenberg, Esq.",
        "address":"1949 Berlin Road Ste 200 Cherry Hill, New Jersey 08003-3737",
        "phone":"856-770-0990",
        "fax":"856-770-8511",
        "email":"agreenberg@hgllclaw.com",
        "website":"",
        "about":"Our Firm provides Creditor's Rights representation for investors, bankruptcy trustees, and others, including tax lien foreclosures, real estate litigation, and bankruptcy litigation, as well as collection and mortgage foreclosures. Our four lawyers have nearly 100 years of combined experience. The Firm handles matters in all N.J. counties, as well as federal and bankruptcy matters in all N.J. federal courts, Eastern District of PA, and the Third Circuit Court of Appeals"
    },
    {
        "name":"JurisDeed",
        "primary_contact":"Primary Contact: Stephen Morel",
        "address":"935 Gravier St., Ste. 1700 New Orleans, Louisiana 70112",
        "phone":"504.858.9839",
        "fax":"",
        "email":"smorel@jurisdeed.com",
        "website":"https://jurisdeed.com/",
        "about":"A.I.-Powered, Insurable Due Diligence Reports, Attorney Examinations and Title Insurance Commitments"
    },
    {
        "name":"Korshak & Associates, P.A.",
        "primary_contact":"Primary Contact: Stephen D. Korshak, L. Karina Dani, Bradford Petrino",
        "address":"950 S. Winter Park Drive Suite 320 Casselberry, Florida 32707",
        "phone":"407-855-3333",
        "fax":"407-855-0455",
        "email":"skorshak@korshaklaw.com",
        "website":"http://www.korshaklaw.com",
        "about":""
    },
    {
        "name":"Law Office of James F. Truitt, P.A.",
        "primary_contact":"Primary Contact: James F. Truitt",
        "address":"20 E. Timonium Rd, Suite 101 Timonium, Maryland 21093",
        "phone":"410.560.9009",
        "fax":"",
        "email":"jtruitt@taxcerts.com",
        "website":"https://www.taxcerts.com/",
        "about":"Tax Certificate Consultants Inc., LLC., has invested and managed over $275 million over the past fifteen years. Tax Certificate Consultants, Inc. provides a variety of services to a tax lien investor including due diligence, investing, servicing, legal and property disposition services. The goal of Tax Certificate Consultants, Inc. is to identify, acquire, and manage a portfolio designed to meet each investor's needs in the most cost effective and efficient manner while maintaining superior returns for its investors. The investment strategy is tailored to the goals of our clients."
    },
    {
        "name":"Manoil Counsel, PLC",
        "primary_contact":"Primary Contact: Mark Manoil",
        "address":"5025 North Central Avenue, PMB 592 Phoenix, Arizona 85012",
        "phone":"602-354-4262",
        "fax":"602-445-9316",
        "email":"mmanoil@azbar.org",
        "website":"http://cpexchange.com",
        "about":""
    },
    {
        "name":"Meridian Title Corporation",
        "primary_contact":"Primary Contact: Brenda R. Flatter",
        "address":"3850 Priority Way Dr. South #120 Indianapolis, Indiana 46240",
        "phone":"317-566-9520",
        "fax":"317-566-9521",
        "email":"bflatter@meridiantitle.com",
        "website":"http://www.meridiantitle.com",
        "about":"Meridian Title Corporation (MTC), formerly known as St. Joseph Title Corp., was established in 1938 as The Abstract Company of St. Joseph County, Inc. With our corporate headquarters located in South Bend, Indiana, Meridian Title Corporation currently has over thirty (30) offices serving markets throughout Indiana, Michigan and Illinois. In addition to its unparalleled customer focus, Meridian Title has the unique ability to issue title policies for a host of National and State Underwriters allowing options to best serve our customer's needs and preferences. MTC is one of the nation's largest independent title agencies with nearly 75 years of experience in providing title insurance coverage, escrow closings, and related services. Meridian Title's mission is to be a leader in providing real estate related services and products. We will strive to exceed the expectations and needs of our customers in the value we provide, in production performance, the quality of our work, through our technology, and with the support of a knowledgeable, experienced, and friendly staff. We will create an environment that attracts, develops and rewards highly effective people. We will be partners with our customers and achieve mutual goals of success, growth and profitability. In 1991, MTC began its expansion in Indiana. Our Elkhart facility is conveniently located in the downtown area, and to better serve our customers in Elkhart County, we expanded our presence by opening an office in Goshen, Indiana. The Mishawaka office, built in 1992, operates as the Escrow Service Center to our South Bend headquarters. This facility contains five separate closing rooms and a waiting area that can comfortably accommodate forty customers. In 1994, MTC expanded west into LaPorte County, Indiana. Our acquisition of an established title company provided us with a complete title plant along with facilities to meet our customers' needs for closing. We further expanded our closing facilities to include an office in Michigan City, Indiana. In 1997, MTC expanded into the Southwestern Michigan counties of Berrien, Cass, St. Joseph and Van Buren. Our Michigan offices are located in Cassopolis, Dowagiac, Edwardsburg, New Buffalo, Niles and St. Joseph. Our next expansion was in Lake and Porter Counties, Indiana. After opening our own operation in Valparaiso in 1999, the opportunity arose to acquire four existing offices that today allow Meridian Title to serve the markets of Crown Point, Hobart, Highland and Portage. During the spring of 2002 Meridian Title Corporation fulfilled a long-term goal and opened an office in Hamilton County, Indiana, one of the fastest growing counties in the nation. The Carmel office allows us to serve Indianapolis and the surrounding counties. In 2003, MTC opened offices in Fort Wayne to serve Allen and the surrounding counties. In 2010, we further expanded our Central Indiana presence by acquiring a long established company in Columbus, IN. In early 2011, MTC expanded into the state of Illinois with an office in Tinley Park. By late fall, we opened our first National Commercial Services office in downtown Chicago serving national multi-site commercial transactions. In keeping up with the ever changing and challenging real estate markets, Meridian Title has created highly successful divisions serving the REO/Foreclosure, Tax Sale and Short Sale needs of our customers. Additionally, through our strong network of underwriters and agents, we have the ability to handle many transactions nationwide."
    },
    {
        "name":"Nelson Mullins Riley & Scarborough LLP",
        "primary_contact":"Primary Contact: Matthew A. Abee",
        "address":"1320 Main Street, 17th Floor Columbia, South Carolina 29201",
        "phone":"803.255.9335",
        "fax":"",
        "email":"matt.abee@nelsonmullins.com",
        "website":"https://www.nelsonmullins.com/",
        "about":"Our culture and multidisciplinary platform provide our community of clients trusted advice to meet a broad range of business needs and our team members an opportunity to be part of a Firm that values relationships, collaboration, thinking ahead, leadership within our profession, and helping those in need through pro bono and community service."
    },
    {
        "name":"O'Connell & Martin",
        "primary_contact":"Primary Contact: Matt O'Connell",
        "address":"5101 Wisconsin Ave NW Suite 210 Washington , District of Columbia 20016",
        "phone":"202-265-7755",
        "fax":"202-265-7756",
        "email":"matt.oconnell@oconnellandmartin.com",
        "website":"http://www.oconnellandmartin.com",
        "about":"Specific States include: DC, MD, NJ, and NY."
    },
    {
        "name":"Pellegrino & Feldstein, L.L.C.",
        "primary_contact":"Primary Contact: Michael Pellegrino",
        "address":"290 Route 46 West Denville, New Jersey 07834",
        "phone":"973-586-2300",
        "fax":"973-586-2580",
        "email":"pell@caplaw.net",
        "website":"http://www.taxlienlawyer.com/index.htm",
        "about":"Specializing in New Jersey tax lien foreclosure. Author of 'Tax Liens, The Complete Guide to Investing in New Jersey Tax Liens.'"
    },
    {
        "name":"Pullman and Comley, LLC",
        "primary_contact":"Primary Contact: Adam Cohen",
        "address":"850 Main Street Bridgeport, Connecticut 06601",
        "phone":"203.330.2000",
        "fax":"203.576.8888",
        "email":"ajcohen@pullcom.com",
        "website":"http://www.pullcom.com",
        "about":"General Counsel of the Connecticut Tax Collector's Association and experienced litigator on behalf of municipalities and tax lien assignees."
    },
    {
        "name":"Quantum Title Research, Inc.",
        "primary_contact":"Primary Contact: Gerald P Wolf II",
        "address":"224 w Jefferson Blvd., Suite 405 South Bend, Indiana 46601",
        "phone":"574-968-8700",
        "fax":"574-234-5400",
        "email":"Quantum@Qt-Research.com",
        "website":"http://www.QuantumTitleResearch.com",
        "about":"Residential, commercial, and tax title searches for St Joseph, Elkhart, Kosciusko, and Marshall counties in Indiana. Real estate property title searches and closings within and including the cities of South Bend, Mishawaka, Goshen, Warsaw, and Plymouth."
    },
    {
        "name":"Regents Park, LLC",
        "primary_contact":"Primary Contact: Eric Kessler",
        "address":"240 North Center Street Mesa, Arizona 85201",
        "phone":"480-430-2130",
        "fax":"480-644-0095",
        "email":"reshakman@regentsparkllc.com",
        "website":"http://regentsparkllc.com/",
        "about":"Regents Park, LLC is the largest tax lien foreclosure servicing company in Arizona. The principle members of the company are Eric Kessler Esq. and Robert Shakman. Eric Kessler has represented tax lien clients for almost 30 years. Regents Park offers an unique 'No Cost/No Fee Program' for its potential customers."
    },
    {
        "name":"Roetzel & Andress",
        "primary_contact":"Primary Contact: Donald R. Dinan",
        "address":"600 14th Street, N.W. Suite 400 Washington, District of Columbia 20005",
        "phone":"202-216-8302",
        "fax":"202-338-6340",
        "email":"ddinan@ralaw.com",
        "website":"http://www.ralaw.com",
        "about":"Mr. Dinan has represent tax certificate holders in the District of Columbia since 1996 when the current system of tax sales went into effect. He represented the District of Columbia's securitized trust in the collection of tax liens, and the DC Water and Sewer Authority's assignees in their sale of Certificates of Delinquency of water bills. Mr. Dinan was one of the attorney's involved in the U.S. Supreme Court challenge to the State of New York's notice provisions. He has advised and helped draft legislation on tax sale law for the D.C. City Council."
    },
    {
        "name":"Sandhu Law Groupl",
        "primary_contact":"Primary Contact: Austin B. Barnes, III",
        "address":"1213 Prospect Avenue, Suite 300 Cleveland, Ohio 44115",
        "phone":"216.373.5512",
        "fax":"216.373.1002",
        "email":"abarnes@sandhu-law.com",
        "website":"https://sandhu-law.com/",
        "about":"The Sandhu Law Group, LLC concentrates in Real Estate Law and Creditors Rights with a resolute emphasis on timeliness, accuracy, accessibility and clear understanding of client's needs. Clients include lenders, banks, credit unions, and other businesses and individuals. Our team consists of attorneys, collectors, real estate title professionals and support staff. We are eager and ready to help clients. Our clients entrust us with related matters, throughout the State of Ohio, including: Bankruptcy, Eviction, Foreclosure, Tax Certificate Foreclosures, Loss mitigation, Real estate title / real estate closing, Collections"
    },
    {
        "name":"Simon PLC, Attorneys & Counselors",
        "primary_contact":"Primary Contact: Kenneth G. Frantz",
        "address":"37000 Woodward Ave. Suite 250 Bloomfield Hills, Michigan 48304",
        "phone":"248-720-0290",
        "fax":"248-720-0291",
        "email":"kfrantz@simonattys.com",
        "website":"http://www.sgfattorneys.com",
        "about":"Simon PLC has several attorneys who are experienced at all aspects of real estate, tax delinquency matters, foreclosures, mortgages and related banking matters. During the period when Michigan was a tax lien state, the firm was very active in this field of law and represented several of the largest nationwide investment entities. The firm currently represents over twenty-five banks and lending institutions. It has offices in seven states - Michigan (main office), Texas, New York, Illinois, Ohio, Arizona, and Florida. Several attorneys are also licensed real estate brokers in Michigan."
    },
    {
        "name":"Tax Title Services, Inc.",
        "primary_contact":"Primary Contact: Ryan Meredith",
        "address":"4590 Macarthur Blvd #210 Newport Beach, California 92660",
        "phone":"949-798-1180",
        "fax":"949-798-1190",
        "email":"rmeredith@taxtitleservices.com",
        "website":"http://www.taxtitleservices.com",
        "about":"Tax Title Services has been assisting tax deed investors with their title insurance needs for NEARLY 2 DECADES and has certified OVER 25,000 properties nationwide. When it comes to protecting your investment or selling/refinancing your property look no further than the industry leading Tax Title Services. Avoid the costs and delays associated with quiet title actions. By partnering with Tax Title Services not only will you find comfort in working with a company that exclusively focuses on certifying tax foreclosed properties, but whose industry knowledge and competency is unrivaled. We offer the most competitive pricing, quickest completion times, and our goal is to exceed your expectations. Please visit our website for additional information, pricing, online ordering, or to view current testimonials from actual TTS clients. We look forward to working with you!!"
    },
    {
        "name":"TaxServ, LLC",
        "primary_contact":"Primary Contact: Robert Sandella",
        "address":"750 Main St, Suite 510 Hartford, Connecticut 06103",
        "phone":"860-724-9100",
        "fax":"860-727-1080",
        "email":"rsandella@taxserv.com",
        "website":"http://www.taxserv.com",
        "about":"TaxServ, LLC is a national company that provides specialized collections in delinquent government receivables. Our firm has extensive experience in collecting real estate, motor vehicle and personal property tax liens; demolition liens; utility charges of all types; court fees and fines; and other municipal receivables, including development authority loans and grants, unpaid use fees, water & sewer charges, parking fines and traffic violations."
    },
    {
        "name":"Taylor and Keyser",
        "primary_contact":"Primary Contact: Robert W. Keyser",
        "address":"76 E. Euclid Avenue Suite 202 Haddonfield, New Jersey 08033",
        "phone":"609-803-2180",
        "fax":"856-494-1191",
        "email":"rkeyser@taylorandkeyser.com",
        "website":"http://www.taylorandkeyser.com",
        "about":"Robert W. Keyser is a partner of the firm. His practice includes the representation of real estate tax lien investors in lien foreclosures, transactions, loans involving tax sale certificates and portfolios, and tax lien litigation. He is a member of the board of directors of the NationalTax Lien Association, and of the New Jersey Tax Lien Finance Corporation. He represents lien holders in the sale of their REO, and as creditors in bankruptcy matters."
    },
    {
        "name":"The Bass Law Firm, LLC",
        "primary_contact":"Primary Contact: J. William Bill Bass, Jr.",
        "address":"311 North Broad Street Cairo, Georgia 39828",
        "phone":"(229)377-2424",
        "fax":"(229)377-7228",
        "email":"bill@basslawcairo.com",
        "website":"http://www.basslawcairo.com/",
        "about":"From writing deeds to handling corporate closings, there is no type of residential or commercial real estate transaction that our firm cannot handle. Contact us online or call 229-377-2424 to schedule your appointment with an experienced lawyer."
    },
    {
        "name":"The Law Office of Richard Samuel Price ",
        "primary_contact":"Primary Contact: Richard Samuel Price",
        "address":"700 E. Redlands Blvd. Ste. U-220 Redlands, California 92373",
        "phone":"(909) 478-9992",
        "fax":"(909) 475-9500",
        "email":"sam@priceattorney.com",
        "website":"http://www.priceattorney.com",
        "about":"R. Sam Price has been practicing law since 2000 and focuses his practice on real estate, asset protection, business, and estate planning. Sam has successfully cleared title by litigating quiet title actions for tax sales. He has written a book about buying property at the tax sale and clearing title that is for sale on Amazon. He knows and understands real estate and business as an active real estate investor, developer, and builder. Sam earned two law degrees from New York University School of Law and Western New England College School of Law."
    },
    {
        "name":"The Law Office of Stephen L. Harker",
        "primary_contact":"Primary Contact: Stephen L. Harker",
        "address":"53 E Broadway 1st Floor Bel Air, Maryland 21014",
        "phone":"410-420-8910",
        "fax":"410-515-4744",
        "email":"steve@harkerlawoffice.com",
        "website":"http://www.harkerlawoffice.com/",
        "about":"The Law Office of Stephen L. Harker is dedicated to helping you succeed in your real estate endeavors. We provide comprehensive, creative legal services and solutions for financial institutions, individuals, and businesses of all sizes. Whether you are purchasing a new property, or need an attorney's advice concerning the viability of property subject to foreclosure, we can help."
    },
    {
        "name":"Weissman Nowack Curry & Wilco, P.C.",
        "primary_contact":"Primary Contact: Brad Hutchins",
        "address":"3500 Lenox Road 4th Floor Atlanta, Georgia 30326",
        "phone":"404-926-4556",
        "fax":"404-926-4756",
        "email":"bradh@wncwlaw.com",
        "website":"http://www.wncwlaw.com",
        "about":"During his 16 years of practice, Brad has handled hundreds of successful suits in property tax-related cases, including more than 20 appellate cases. Brad is the author of the current Georgia statue that authorizes the transfer of tax liens to private parties. Brad specializes in representing clients involved in the purchase of property tax liens and tax foreclosure deeds, and has handled hundreds of quiet title actions in the superior courts across the state. His core expertise is delinquent property tax representation."
    }
]